РП/src/Reports/СтруктураСерииНоменклатуры/СтруктураСерииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СтруктураСерииНоменклатуры</name>
</mdclass:Report>

РП/src/AccumulationRegisters/ДвиженияСерийТоваров/ДвиженияСерийТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвиженияСерийТоваров</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ВнутреннееПотреблениеТоваров</types>
      <types>DocumentRef.АктОРасхожденияхПослеПеремещения</types>
      <types>DocumentRef.РасходныйОрдерНаТовары</types>
      <types>DocumentRef.АктОРасхожденияхПослеОтгрузки</types>
      <types>DocumentRef.ПередачаДавальцу</types>
      <types>DocumentRef.СписаниеЗатратНаВыпуск</types>
      <types>DocumentRef.ПеремещениеМатериаловВПроизводстве</types>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ЧекККМВозврат</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ПоступлениеСырьяОтДавальца</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.РаспределениеПроизводственныхЗатрат</types>
      <types>DocumentRef.АктОРасхожденияхПослеПриемки</types>
      <types>DocumentRef.ЗаказМатериаловВПроизводство</types>
      <types>DocumentRef.ВводОстатков</types>
      <types>DocumentRef.ЗаказПереработчику</types>
      <types>DocumentRef.ОрдерНаОтражениеИзлишковТоваров</types>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.СписаниеНедостачТоваров</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ВозвратСырьяДавальцу</types>
      <types>DocumentRef.ОрдерНаОтражениеНедостачТоваров</types>
      <types>DocumentRef.ОрдерНаОтражениеПорчиТоваров</types>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.КорректировкаПоОрдеруНаТовары</types>
      <types>DocumentRef.ПередачаСырьяПереработчику</types>
      <types>DocumentRef.ПересортицаТоваров</types>
      <types>DocumentRef.ПересчетТоваров</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ЗаказНаПеремещение</types>
      <types>DocumentRef.ОприходованиеИзлишковТоваров</types>
      <types>DocumentRef.ВозвратСырьяОтПереработчика</types>
      <types>DocumentRef.ЧекККМ</types>
      <types>DocumentRef.ВыпускПродукции</types>
      <types>DocumentRef.СборкаТоваров</types>
      <types>DocumentRef.ОтборРазмещениеТоваров</types>
      <types>DocumentRef.МаршрутныйЛистПроизводства</types>
      <types>DocumentRef.ВозвратМатериаловИзПроизводства</types>
      <types>DocumentRef.ПриходныйОрдерНаТовары</types>
      <types>DocumentRef.ПрочееОприходованиеТоваров</types>
      <types>DocumentRef.ЗаказНаВнутреннееПотребление</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.ЗаказДавальца</types>
      <types>DocumentRef.ОрдерНаПеремещениеТоваров</types>
      <types>DocumentRef.ПередачаМатериаловВПроизводство</types>
      <types>DocumentRef.ПорчаТоваров</types>
      <types>DocumentRef.ПоступлениеОтПереработчика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПомещениеОтправителя</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СкладскаяОперация</name>
    <type>
      <types>EnumRef.СкладскиеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПомещениеПолучателя</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаПолучателя</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтоСкладскоеДвижение</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

РП/src/Enums/СкладскиеОперации/СкладскиеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СкладскиеОперации</name>
  <enumValues>
    <name>ВводОстатков</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзПроизводстваНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ВозвратНепринятыхТоваров</name>
  </enumValues>
  <enumValues>
    <name>КонтрольОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ВыпускПродукцииВПодразделение</name>
  </enumValues>
  <enumValues>
    <name>ОтборИзЯчеек</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаВРозницу</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаКомплектовДляРазборки</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаКомплектующихДляСборки</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаНаВнутренниеНужды</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаПоВозвратуПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаПоПеремещению</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеИзлишков</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаПоПеремещениюВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеВыходныхИзделийВМаршрутныхЛистах</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеНедостач</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеПорчи</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеРезультатовПересчетов</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеМеждуПомещениями</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВПроизводствоОтгрузка</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВПроизводствоПриемка</name>
  </enumValues>
  <enumValues>
    <name>Пересчет</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаКомплектующихПослеРазборки</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПоВозвратуОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПоПеремещению</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПоПрочемуОприходованию</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПоПеремещениюВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПродукцииИзПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаСобранныхКомплектов</name>
  </enumValues>
  <enumValues>
    <name>РазмещениеВЯчейки</name>
  </enumValues>
  <enumValues>
    <name>ВозвратНепринятыхТоваровУстарел</name>
  </enumValues>
  <enumValues>
    <name>РасходМатериаловПриВыполненииМаршрутныхЛистов</name>
  </enumValues>
  <enumValues>
    <name>СписаниеМатериаловНаЗатраты</name>
  </enumValues>
</mdclass:Enum>

РП/src/Enums/СтатусыМаршрутныхЛистовПроизводства/СтатусыМаршрутныхЛистовПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыМаршрутныхЛистовПроизводства</name>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>КВыполнению</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

РП/src/Reports/СтруктураСерииНоменклатуры/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Формирует структуру серии номенклатуры - какие серии материалов использовались при производстве/сборке
//
// АЛГОРИТМ
// 1. Получить данные о поступлении требуемой серии
// 1.1. Серия может поступить следующими способами
//      - по графику производства - отражается маршрутными листами или выпуском продукции по распоряжению
//      - без графика производства - отражается выпуском продукции без распоряжения
//      - при сборке (разборке) товаров - отражается сборкой (разборкой)
//
// 2. Получить данные о расходе серий на полученные поступления
// 2.1. Расход серии может произойти следующими способами
//      - если серия поступила по графику производства, то
//         - при выполнении маршрутных листов - отражается маршрутными листами
//         - при распределении затрат на график производства - отражается распределением затрат
//      - если серия поступила не по графику производства, то
//         - при распределении затрат на выпуски без распоряжений
//      - если серия поступила при сборке (разборке), то
//         - при сборке (разборке)
//
// Параметры:
//  Параметры	- Структура - содержит параметры необходимые для формирования структуры серии
//
Функция СтруктураСерииНоменклатуры(Параметры) Экспорт
	
	СтруктураСерииНоменклатурыДерево = Новый ДеревоЗначений;
	СтруктураСерииНоменклатурыДерево.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	СтруктураСерииНоменклатурыДерево.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	СтруктураСерииНоменклатурыДерево.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	СтруктураСерииНоменклатурыДерево.Колонки.Добавить("Израсходовано", Новый ОписаниеТипов("Число"));
	СтруктураСерииНоменклатурыДерево.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("Строка"));
	СтруктураСерииНоменклатурыДерево.Колонки.Добавить("НоменклатураПредставление", Новый ОписаниеТипов("Строка"));
	СтруктураСерииНоменклатурыДерево.Колонки.Добавить("СерияПредставление", Новый ОписаниеТипов("Строка"));
	
	СтруктураСерииКоллекция = СтруктураСерииНоменклатурыДерево.Строки;
	
	СписокНоменклатуры = Новый ТаблицаЗначений;
	СписокНоменклатуры.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	СписокНоменклатуры.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	СписокНоменклатуры.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	СписокНоменклатуры.Колонки.Добавить("Строки");
	
	НоваяСтрока = СписокНоменклатуры.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Параметры);
	НоваяСтрока.Строки = СтруктураСерииКоллекция;
	
	// Для предотвращения зацикливания
	ОтработаннаяНоменклатура = Новый ТаблицаЗначений;
	ОтработаннаяНоменклатура.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ОтработаннаяНоменклатура.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ОтработаннаяНоменклатура.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	
	НоваяСтрока = ОтработаннаяНоменклатура.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Параметры);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Пока СписокНоменклатуры.Количество() <> 0 Цикл
		
		НовыйСписокНоменклатуры = СписокНоменклатуры.СкопироватьКолонки();
		
		ИспользованныеСерии = ИспользованныеСерии(СписокНоменклатуры);
		Для каждого СтрокаНоменклатура Из СписокНоменклатуры Цикл
			СтруктураПоиска = Новый Структура("НоменклатураСписка,СерияСписка", СтрокаНоменклатура.Номенклатура, СтрокаНоменклатура.Серия);
	  		СписокСтрок = ИспользованныеСерии.НайтиСтроки(СтруктураПоиска);
			Для каждого СтрокаСерияМатериала Из СписокСтрок Цикл
				
				НоваяСерия = СтрокаНоменклатура.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСерия, СтрокаСерияМатериала);
				
				НоваяСерия.НоменклатураПредставление = НоменклатураКлиентСервер.ПредставлениеНоменклатуры(
																СтрокаСерияМатериала.НоменклатураПредставление,
																СтрокаСерияМатериала.ХарактеристикаПредставление);
				
				// Для предотвращения зацикливания
				СтруктураПоиска = Новый Структура("Номенклатура,Характеристика,Серия", 
											НоваяСерия.Номенклатура, НоваяСерия.Характеристика, НоваяСерия.Серия);
			 	СписокСтрок = ОтработаннаяНоменклатура.НайтиСтроки(СтруктураПоиска);
				Если СписокСтрок.Количество() = 0 Тогда
					НоваяНоменклатура = НовыйСписокНоменклатуры.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяНоменклатура, НоваяСерия);
					НоваяНоменклатура.Строки = НоваяСерия.Строки;
				КонецЕсли; 
				
			КонецЦикла; 
		КонецЦикла;
		
		СписокНоменклатуры = НовыйСписокНоменклатуры.Скопировать();
		
	КонецЦикла; 
	
	Возврат СтруктураСерииНоменклатурыДерево;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИспользованныеСерии(СписокНоменклатуры)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СписокНоменклатуры.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(СписокНоменклатуры.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	|	ВЫРАЗИТЬ(СписокНоменклатуры.Серия КАК Справочник.СерииНоменклатуры) КАК Серия
	|ПОМЕСТИТЬ СписокНоменклатуры
	|ИЗ
	|	&СписокНоменклатуры КАК СписокНоменклатуры
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Серия
	|;
	|";
	
	//++ НЕ УТ
	#Область ПоступлениеСерииВПроизводстве
	Запрос.Текст = Запрос.Текст + 
	"
	//++ НЕ УТКА
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДвижениеСерии.Номенклатура КАК Номенклатура,
	|	ДвижениеСерии.Характеристика КАК Характеристика,
	|	ДвижениеСерии.Серия КАК Серия,
	|	ВЫРАЗИТЬ(ДвижениеСерии.Документ КАК Документ.МаршрутныйЛистПроизводства) КАК Документ,
	|	ВЫРАЗИТЬ(ДвижениеСерии.Документ КАК Документ.МаршрутныйЛистПроизводства).Распоряжение КАК Распоряжение,
	|	ВЫРАЗИТЬ(ДвижениеСерии.Документ КАК Документ.МаршрутныйЛистПроизводства).КодСтроки КАК КодСтроки,
	|	ВЫРАЗИТЬ(ДвижениеСерии.Документ КАК Документ.МаршрутныйЛистПроизводства).КодСтрокиЭтапыГрафик КАК КодСтрокиЭтапыГрафик,
	|	ВЫРАЗИТЬ(ДвижениеСерии.Документ КАК Документ.МаршрутныйЛистПроизводства).Этап КАК Этап,
	|	ВЫРАЗИТЬ(ДвижениеСерии.Документ КАК Документ.МаршрутныйЛистПроизводства).НоменклатураПолуфабриката КАК НоменклатураПолуфабриката,
	|	ВЫРАЗИТЬ(ДвижениеСерии.Документ КАК Документ.МаршрутныйЛистПроизводства).ХарактеристикаПолуфабриката КАК ХарактеристикаПолуфабриката,
	|	ВЫРАЗИТЬ(ДвижениеСерии.Документ КАК Документ.МаршрутныйЛистПроизводства).НомерПартии КАК НомерПартии,
	|	ДвижениеСерии.КоличествоОборот КАК Количество
	|ПОМЕСТИТЬ ПоступлениеСерииПоГрафикуПроизводства
	|ИЗ
	|	РегистрНакопления.ДвиженияСерийТоваров.Обороты(
	|			,
	|			,
	|			,
	|			(Номенклатура, Характеристика, Серия) В
	|					(ВЫБРАТЬ
	|						СписокНоменклатуры.Номенклатура,
	|						СписокНоменклатуры.Характеристика,
	|						СписокНоменклатуры.Серия
	|					ИЗ
	|						СписокНоменклатуры КАК СписокНоменклатуры)
	|				И СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ОтражениеВыходныхИзделийВМаршрутныхЛистах)) КАК ДвижениеСерии
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Серия,
	|	Распоряжение,
	|	КодСтроки,
	|	КодСтрокиЭтапыГрафик
	|;
	//-- НЕ УТКА
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДвижениеСерии.Номенклатура КАК Номенклатура,
	|	ДвижениеСерии.Характеристика КАК Характеристика,
	|	ДвижениеСерии.Серия КАК Серия,
	|	ВЫРАЗИТЬ(ДвижениеСерии.Документ КАК Документ.ВыпускПродукции) КАК Документ,
	|	ДвижениеСерии.КоличествоОборот КАК Количество
	|ПОМЕСТИТЬ ПоступлениеСерииПоВыпуску
	|ИЗ
	|	РегистрНакопления.ДвиженияСерийТоваров.Обороты(
	|			,
	|			,
	|			,
	|			(Номенклатура, Характеристика, Серия) В
	|					(ВЫБРАТЬ
	|						СписокНоменклатуры.Номенклатура,
	|						СписокНоменклатуры.Характеристика,
	|						СписокНоменклатуры.Серия
	|					ИЗ
	|						СписокНоменклатуры КАК СписокНоменклатуры)
	|				И СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ПриемкаПродукцииИзПроизводства)) КАК ДвижениеСерии
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Серия,
	|	Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеСерииПоВыпуску.Номенклатура КАК Номенклатура,
	|	ПоступлениеСерииПоВыпуску.Характеристика КАК Характеристика,
	|	ПоступлениеСерииПоВыпуску.Серия КАК Серия,
	|	ТаблицаТовары.Распоряжение КАК Распоряжение,
	|	ПоступлениеСерииПоВыпуску.Количество КАК Количество
	|ПОМЕСТИТЬ ПоступлениеСерииВыпускПоРаспоряжению
	|ИЗ
	|	ПоступлениеСерииПоВыпуску КАК ПоступлениеСерииПоВыпуску
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыпускПродукции КАК ТаблицаДокумента
	|		ПО (ТаблицаДокумента.Ссылка = ПоступлениеСерииПоВыпуску.Документ)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыпускПродукции.Товары КАК ТаблицаТовары
	|		ПО (ТаблицаТовары.Ссылка = ПоступлениеСерииПоВыпуску.Документ)
	|			И (ТаблицаТовары.Номенклатура = ПоступлениеСерииПоВыпуску.Номенклатура)
	|ГДЕ
	|	ТаблицаДокумента.ВыпускПоРаспоряжениям
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Распоряжение
	|;
	|";
	#КонецОбласти
	//-- НЕ УТ
	
	#Область ПоступлениеСерииПриСборке
	Запрос.Текст = Запрос.Текст + 
	"////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДвижениеСерии.Номенклатура КАК Номенклатура,
	|	ДвижениеСерии.Характеристика КАК Характеристика,
	|	ДвижениеСерии.Серия КАК Серия,
	|	ВЫРАЗИТЬ(ДвижениеСерии.Документ КАК Документ.СборкаТоваров) КАК Документ,
	|	ДвижениеСерии.КоличествоОборот КАК Количество
	|ПОМЕСТИТЬ ПоступлениеСерииПоСборке
	|ИЗ
	|	РегистрНакопления.ДвиженияСерийТоваров.Обороты(
	|			,
	|			,
	|			,
	|			(Номенклатура, Характеристика, Серия) В
	|					(ВЫБРАТЬ
	|						СписокНоменклатуры.Номенклатура,
	|						СписокНоменклатуры.Характеристика,
	|						СписокНоменклатуры.Серия
	|					ИЗ
	|						СписокНоменклатуры КАК СписокНоменклатуры)
	|				И СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ПриемкаСобранныхКомплектов)) КАК ДвижениеСерии
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Серия,
	|	Документ
	|;
	|";
	#КонецОбласти
	
	//++ НЕ УТ
	#Область ДокументыРасходаСерийПриПроизводстве
	Запрос.Текст = Запрос.Текст + 
	"
	//++ НЕ УТКА
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеСерии.Номенклатура КАК Номенклатура,
	|	ПоступлениеСерии.Характеристика КАК Характеристика,
	|	ПоступлениеСерии.Серия КАК Серия,
	|	МаршрутныйЛистПроизводства.Ссылка КАК Ссылка,
	|	МаршрутныйЛистПроизводства.Распоряжение КАК Распоряжение,
	|	МаршрутныйЛистПроизводства.КодСтроки КАК КодСтроки,
	|	МаршрутныйЛистПроизводства.Этап КАК Этап,
	|	МаршрутныйЛистПроизводства.НомерПартии КАК НомерПартии
	|ПОМЕСТИТЬ МаршрутныеЛисты
	|ИЗ
	|	ПоступлениеСерииПоГрафикуПроизводства КАК ПоступлениеСерии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаршрутныйЛистПроизводства КАК МаршрутныйЛистПроизводства
	|		ПО (МаршрутныйЛистПроизводства.Распоряжение = ПоступлениеСерии.Распоряжение)
	|			И (МаршрутныйЛистПроизводства.КодСтроки = ПоступлениеСерии.КодСтроки)
	|			И (МаршрутныйЛистПроизводства.НомерПартии = ПоступлениеСерии.НомерПартии)
	|			И (МаршрутныйЛистПроизводства.НоменклатураПолуфабриката = ПоступлениеСерии.НоменклатураПолуфабриката)
	|			И (МаршрутныйЛистПроизводства.ХарактеристикаПолуфабриката = ПоступлениеСерии.ХарактеристикаПолуфабриката)
	|			И (МаршрутныйЛистПроизводства.Проведен)
	|			И (МаршрутныйЛистПроизводства.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыМаршрутныхЛистовПроизводства.Отменен))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеСерии.Номенклатура,
	|	ПоступлениеСерии.Характеристика,
	|	ПоступлениеСерии.Серия,
	|	МаршрутныйЛистПроизводства.Ссылка,
	|	МаршрутныйЛистПроизводства.Распоряжение,
	|	МаршрутныйЛистПроизводства.КодСтроки,
	|	МаршрутныйЛистПроизводства.Этап,
	|	МаршрутныйЛистПроизводства.НомерПартии
	|ИЗ
	|	ПоступлениеСерииВыпускПоРаспоряжению КАК ПоступлениеСерии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаршрутныйЛистПроизводства КАК МаршрутныйЛистВыпуска
	|		ПО (МаршрутныйЛистВыпуска.Ссылка = ПоступлениеСерии.Распоряжение)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаршрутныйЛистПроизводства КАК МаршрутныйЛистПроизводства
	|		ПО (МаршрутныйЛистПроизводства.Распоряжение = МаршрутныйЛистВыпуска.Распоряжение)
	|			И (МаршрутныйЛистПроизводства.КодСтроки = МаршрутныйЛистВыпуска.КодСтроки)
	|			И (МаршрутныйЛистПроизводства.НомерПартии = МаршрутныйЛистВыпуска.НомерПартии)
	|			И (МаршрутныйЛистПроизводства.НоменклатураПолуфабриката = МаршрутныйЛистВыпуска.НоменклатураПолуфабриката)
	|			И (МаршрутныйЛистПроизводства.ХарактеристикаПолуфабриката = МаршрутныйЛистВыпуска.ХарактеристикаПолуфабриката)
	|			И (МаршрутныйЛистПроизводства.Проведен)
	|			И (МаршрутныйЛистПроизводства.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыМаршрутныхЛистовПроизводства.Отменен))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МаршрутныеЛисты.Номенклатура КАК Номенклатура,
	|	МаршрутныеЛисты.Характеристика КАК Характеристика,
	|	МаршрутныеЛисты.Серия КАК Серия,
	|	МаршрутныеЛисты.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ МаршрутныеЛистыСписка
	|ИЗ
	|	МаршрутныеЛисты КАК МаршрутныеЛисты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.Характеристика КАК Характеристика,
	|	ВложенныйЗапрос.Серия КАК Серия,
	|	ВложенныйЗапрос.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ РаспределениеЗатратНаЭтапыГрафика
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПоступлениеСерии.Номенклатура КАК Номенклатура,
	|		ПоступлениеСерии.Характеристика КАК Характеристика,
	|		ПоступлениеСерии.Серия КАК Серия,
	|		РаспределениеЗатрат.Ссылка КАК Ссылка
	|	ИЗ
	|		ПоступлениеСерииПоГрафикуПроизводства КАК ПоступлениеСерии
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПроизводственныхЗатрат.ЭтапыГрафикаПроизводства КАК РаспределениеЗатрат
	|			ПО (РаспределениеЗатрат.ЗаказНаПроизводство = ПоступлениеСерии.Распоряжение)
	|				И (РаспределениеЗатрат.КодСтрокиПродукция = ПоступлениеСерии.КодСтроки)
	|				И (РаспределениеЗатрат.Этап = ПоступлениеСерии.Этап)
	|				И (РаспределениеЗатрат.Ссылка.Проведен)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		МаршрутныеЛисты.Номенклатура,
	|		МаршрутныеЛисты.Характеристика,
	|		МаршрутныеЛисты.Серия,
	|		РаспределениеЗатрат.Ссылка
	|	ИЗ
	|		МаршрутныеЛисты КАК МаршрутныеЛисты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПроизводственныхЗатрат.ЭтапыГрафикаПроизводства КАК РаспределениеЗатрат
	|			ПО (РаспределениеЗатрат.ЗаказНаПроизводство = МаршрутныеЛисты.Распоряжение)
	|				И (РаспределениеЗатрат.КодСтрокиПродукция = МаршрутныеЛисты.КодСтроки)
	|				И (РаспределениеЗатрат.Этап = МаршрутныеЛисты.Этап)
	|				И (РаспределениеЗатрат.Ссылка.Проведен)) КАК ВложенныйЗапрос
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	//-- НЕ УТКА
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.Характеристика КАК Характеристика,
	|	ВложенныйЗапрос.Серия КАК Серия,
	|	ВложенныйЗапрос.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ РаспределениеЗатратНаВыпускБезРаспоряжений
	|ИЗ
	|	(ВЫБРАТЬ
	|		РаспределениеЗатрат.Номенклатура КАК Номенклатура,
	|		РаспределениеЗатрат.Характеристика КАК Характеристика,
	|		РаспределениеЗатрат.Серия КАК Серия,
	|		РаспределениеЗатрат.Ссылка КАК Ссылка
	|	ИЗ
	|		Документ.РаспределениеПроизводственныхЗатрат.ВыпускиБезРаспоряжения КАК РаспределениеЗатрат
	|	ГДЕ
	|		(РаспределениеЗатрат.Номенклатура, РаспределениеЗатрат.Серия) В
	|				(ВЫБРАТЬ
	|					СписокНоменклатуры.Номенклатура,
	|					СписокНоменклатуры.Серия
	|				ИЗ
	|					СписокНоменклатуры КАК СписокНоменклатуры)
	|		И РаспределениеЗатрат.Ссылка.Проведен
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПоступлениеСерииПоВыпуску.Номенклатура,
	|		ПоступлениеСерииПоВыпуску.Характеристика,
	|		ПоступлениеСерииПоВыпуску.Серия,
	|		ТаблицаВыходныеИзделия.Ссылка
	|	ИЗ
	|		ПоступлениеСерииПоВыпуску КАК ПоступлениеСерииПоВыпуску
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеЗатратНаВыпуск.ВыходныеИзделия КАК ТаблицаВыходныеИзделия
	|		ПО ТаблицаВыходныеИзделия.Распоряжение = ПоступлениеСерииПоВыпуску.Документ
	|			И ТаблицаВыходныеИзделия.Номенклатура = ПоступлениеСерииПоВыпуску.Номенклатура
	|			И ТаблицаВыходныеИзделия.Характеристика = ПоступлениеСерииПоВыпуску.Характеристика
	|			И ТаблицаВыходныеИзделия.Ссылка.Проведен) КАК ВложенныйЗапрос
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|";
	#КонецОбласти
	//-- НЕ УТ
	
	#Область РасходСерий
	Запрос.Текст = Запрос.Текст + 
	"////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеСерииПоСборке.Номенклатура КАК НоменклатураСписка,
	|	ПоступлениеСерииПоСборке.Характеристика КАК ХарактеристикаСписка,
	|	ПоступлениеСерииПоСборке.Серия КАК СерияСписка,
	|	ИспользованныеСерии.Документ КАК Документ,
	|	ИспользованныеСерии.Отправитель КАК Подразделение,
	|	ИспользованныеСерии.Номенклатура КАК Номенклатура,
	|	ИспользованныеСерии.Номенклатура.Представление КАК НоменклатураПредставление,
	|	ИспользованныеСерии.Номенклатура.ЕдиницаИзмерения.Представление КАК ЕдиницаИзмерения,
	|	ИспользованныеСерии.Характеристика КАК Характеристика,
	|	ИспользованныеСерии.Характеристика.Представление КАК ХарактеристикаПредставление,
	|	ИспользованныеСерии.Серия КАК Серия,
	|	ИспользованныеСерии.Серия.Представление КАК СерияПредставление,
	|	ИспользованныеСерии.КоличествоОборот КАК Израсходовано
	|ИЗ
	|	РегистрНакопления.ДвиженияСерийТоваров.Обороты(
	|			,
	|			,
	|			,
	|			Документ В
	|					(ВЫБРАТЬ
	|						ПоступлениеСерииПоСборке.Документ
	|					ИЗ
	|						ПоступлениеСерииПоСборке)
	|				И СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ОтгрузкаКомплектующихДляСборки)) КАК ИспользованныеСерии
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПоступлениеСерииПоСборке КАК ПоступлениеСерииПоСборке
	|		ПО (ПоступлениеСерииПоСборке.Документ = ИспользованныеСерии.Документ)
	//++ НЕ УТ
	//++ НЕ УТКА
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МаршрутныеЛистыСписка.Номенклатура КАК НоменклатураСписка,
	|	МаршрутныеЛистыСписка.Характеристика КАК ХарактеристикаСписка,
	|	МаршрутныеЛистыСписка.Серия КАК СерияСписка,
	|	ИспользованныеСерии.Документ КАК Документ,
	|	ВЫРАЗИТЬ(ИспользованныеСерии.Документ КАК Документ.МаршрутныйЛистПроизводства).Подразделение КАК Подразделение,
	|	ИспользованныеСерии.Номенклатура КАК Номенклатура,
	|	ИспользованныеСерии.Номенклатура.Представление КАК НоменклатураПредставление,
	|	ИспользованныеСерии.Номенклатура.ЕдиницаИзмерения.Представление КАК ЕдиницаИзмерения,
	|	ИспользованныеСерии.Характеристика КАК Характеристика,
	|	ИспользованныеСерии.Характеристика.Представление КАК ХарактеристикаПредставление,
	|	ИспользованныеСерии.Серия КАК Серия,
	|	ИспользованныеСерии.Серия.Представление КАК СерияПредставление,
	|	ИспользованныеСерии.КоличествоОборот КАК Израсходовано
	|ИЗ
	|	РегистрНакопления.ДвиженияСерийТоваров.Обороты(
	|			,
	|			,
	|			,
	|			Документ В
	|					(ВЫБРАТЬ
	|						МаршрутныеЛистыСписка.Ссылка
	|					ИЗ
	|						МаршрутныеЛистыСписка)
	|				И СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.РасходМатериаловПриВыполненииМаршрутныхЛистов)) КАК ИспользованныеСерии
	|		ЛЕВОЕ СОЕДИНЕНИЕ МаршрутныеЛистыСписка КАК МаршрутныеЛистыСписка
	|		ПО (МаршрутныеЛистыСписка.Ссылка = ИспользованныеСерии.Документ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РаспределениеЗатратНаЭтапыГрафика.Номенклатура,
	|	РаспределениеЗатратНаЭтапыГрафика.Характеристика,
	|	РаспределениеЗатратНаЭтапыГрафика.Серия,
	|	ИспользованныеСерии.Документ,
	|	НЕОПРЕДЕЛЕНО,
	|	ИспользованныеСерии.Номенклатура,
	|	ИспользованныеСерии.Номенклатура.Представление,
	|	ИспользованныеСерии.Номенклатура.ЕдиницаИзмерения.Представление,
	|	ИспользованныеСерии.Характеристика,
	|	ИспользованныеСерии.Характеристика.Представление,
	|	ИспользованныеСерии.Серия,
	|	ИспользованныеСерии.Серия.Представление,
	|	ИспользованныеСерии.КоличествоОборот
	|ИЗ
	|	РегистрНакопления.ДвиженияСерийТоваров.Обороты(
	|			,
	|			,
	|			,
	|			Документ В
	|					(ВЫБРАТЬ
	|						РаспределениеЗатратНаЭтапыГрафика.Ссылка
	|					ИЗ
	|						РаспределениеЗатратНаЭтапыГрафика)
	|				И СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.СписаниеМатериаловНаЗатраты)) КАК ИспользованныеСерии
	|		ЛЕВОЕ СОЕДИНЕНИЕ РаспределениеЗатратНаЭтапыГрафика КАК РаспределениеЗатратНаЭтапыГрафика
	|		ПО (РаспределениеЗатратНаЭтапыГрафика.Ссылка = ИспользованныеСерии.Документ)
	//-- НЕ УТКА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РаспределениеЗатратНаВыпускБезРаспоряжений.Номенклатура,
	|	РаспределениеЗатратНаВыпускБезРаспоряжений.Характеристика,
	|	РаспределениеЗатратНаВыпускБезРаспоряжений.Серия,
	|	ИспользованныеСерии.Документ,
	|	НЕОПРЕДЕЛЕНО,
	|	ИспользованныеСерии.Номенклатура,
	|	ИспользованныеСерии.Номенклатура.Представление,
	|	ИспользованныеСерии.Номенклатура.ЕдиницаИзмерения.Представление,
	|	ИспользованныеСерии.Характеристика,
	|	ИспользованныеСерии.Характеристика.Представление,
	|	ИспользованныеСерии.Серия,
	|	ИспользованныеСерии.Серия.Представление,
	|	ИспользованныеСерии.КоличествоОборот
	|ИЗ
	|	РегистрНакопления.ДвиженияСерийТоваров.Обороты(
	|			,
	|			,
	|			,
	|			Документ В
	|					(ВЫБРАТЬ
	|						РаспределениеЗатратНаВыпускБезРаспоряжений.Ссылка
	|					ИЗ
	|						РаспределениеЗатратНаВыпускБезРаспоряжений)
	|				И СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.СписаниеМатериаловНаЗатраты)) КАК ИспользованныеСерии
	|		ЛЕВОЕ СОЕДИНЕНИЕ РаспределениеЗатратНаВыпускБезРаспоряжений КАК РаспределениеЗатратНаВыпускБезРаспоряжений
	|		ПО (РаспределениеЗатратНаВыпускБезРаспоряжений.Ссылка = ИспользованныеСерии.Документ)
	//-- НЕ УТ
	|
	|
	|УПОРЯДОЧИТЬ ПО
	|	НоменклатураПредставление,
	|	ХарактеристикаПредставление,
	|	СерияПредставление";
	#КонецОбласти
	
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Индексы.Добавить("НоменклатураСписка,СерияСписка");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
